app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM "recipes"

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)

  def create
    @recipe = Recipe.new(params[:recipe])
    if @recipe.save
---
INSERT INTO "recipes" ("created_at", "title", "method", "updated_at", "user_id") VALUES('2011-02-14 13:49:31', 'Chip Buttie', 'Butter bread, deep fry chips and place chips on bread add sauce!', '2011-02-14 13:49:31', NULL)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 5)

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update_attributes(params[:recipe])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 6)
UPDATE "recipes" SET "updated_at" = '2011-01-31 13:32:28', "title" = 'new title', "method" = 'made some changes' WHERE "id" = 6

  def destroy
  @recipe = Recipe.find(params[:id])
  @recipe.destroy
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 7)
DELETE FROM "recipes" WHERE "id" = 7