app/controllers/votes_controller.rb

  def create
  @recipe = Recipe.find(params[:recipe_id])
  @recipe.votes.create
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
INSERT INTO "votes" ("created_at", "recipe_id", "updated_at") VALUES('2011-02-14 15:41:15', 1, '2011-02-14 15:41:15')